//**************************************************************************
//  similar I2C For HX711
//**************************************************************************
/*  Описание:
Full-scale differential input
Voltage of :
Channel A ±20mV
Channel B ±40mV
Продолжительность импульсов на PD_SCK:
от 0,2 - 50 мксек
//**************************************************************************
Как работать:
1.Прочитать , что ADOUT = 0;
2.Начать подавать исмпульсы ADSK(количество импульсов PD_SCK) 
параллельно складывать значение с ADOUT в буфер.
3.
//**************************************************************************
_____________________________
| PD_SCK	| 	In	| 	GAIN 	|
|		25		|		A		|		128		|
|		26		|		B		|		32		|
|		27		|		A		|		64		|
|_________|_______|_________|              */

#define PD_SCK 25
#define SIZE_DATA 24

unsigned long ADCHX711_Read(void);
void ADCHX711_Initial(void);


